### Classification Notebook

In [80]:
from math import sqrt
from scipy import stats
from pydataset import data
from datetime import datetime

from sklearn.model_selection import train_test_split

%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from env import host, user, password
from acquire import get_titanic_data, get_iris_data, get_iris_df, get_titanic_df

##### In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
iris_df = data('iris')
iris_df.head(3)  ## Question 1: Print the first three rows

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
iris_df.shape ## Question 2: Print the number of rows and columns

(150, 5)

In [6]:
iris_df.columns ## Question 3: Print the column names

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [9]:
iris_df.info() ## Question 4: Print the data types of each column

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [12]:
iris_df.describe() ## Question 5: Print out the sumarry statistics of each numeric variable

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

##### Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [13]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1NS_AqvYEsZXF2nL3Gp2PqcwCPbEUfXTq0vGZbTNe_nI/edit#gid=1023018493'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_excel = pd.read_csv(csv_export_url) 
df_excel

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_internet,has_phone_and_internet,partner_dependants,start_date,average_monthly,internet_description,contract_description,phone_description,only_phone,only_internet
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,$65.60,...,True,True,3,8/10/2020,$65.60,DSL,1 Year,One Line,False,False
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,$59.90,...,True,True,0,8/10/2020,$59.90,DSL,Month-to-Month,Two or More Lines,False,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,$73.90,...,True,True,0,1/17/2021,$73.90,Fiber Optic,Month-to-Month,One Line,False,False
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,$98.00,...,True,True,1,4/23/2020,$98.00,Fiber Optic,Month-to-Month,One Line,False,False
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,$83.90,...,True,True,1,2/5/2021,$83.90,Fiber Optic,Month-to-Month,One Line,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9987-LUTYD,Female,0,No,No,1,1,1,Mailed check,$55.15,...,True,True,0,3/29/2020,$55.15,DSL,1 Year,One Line,False,False
7039,9992-RRAMN,Male,0,Yes,No,2,2,0,Electronic check,$85.10,...,True,True,1,7/13/2019,$85.10,Fiber Optic,Month-to-Month,Two or More Lines,False,False
7040,9992-UJOEL,Male,0,No,No,1,1,0,Mailed check,$50.30,...,True,True,0,3/17/2021,$50.30,DSL,Month-to-Month,One Line,False,False
7041,9993-LHIEB,Male,0,Yes,Yes,1,1,2,Mailed check,$67.85,...,True,True,3,9/7/2015,$67.85,DSL,2 Year,One Line,False,False
7042,9995-HOTOH,Male,0,Yes,Yes,0,1,2,Electronic check,$59.00,...,True,False,3,2/17/2016,$59.00,DSL,2 Year,No Phone Service,False,True

In [15]:
df_excel_sample = df_excel.head(100)
df_excel_sample.head(5) ##Question 1: create a sample of the first 100 rows

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_internet,has_phone_and_internet,partner_dependants,start_date,average_monthly,internet_description,contract_description,phone_description,only_phone,only_internet
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,$65.60,...,True,True,3,8/10/2020,$65.60,DSL,1 Year,One Line,False,False
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,$59.90,...,True,True,0,8/10/2020,$59.90,DSL,Month-to-Month,Two or More Lines,False,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,$73.90,...,True,True,0,1/17/2021,$73.90,Fiber Optic,Month-to-Month,One Line,False,False
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,$98.00,...,True,True,1,4/23/2020,$98.00,Fiber Optic,Month-to-Month,One Line,False,False
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,$83.90,...,True,True,1,2/5/2021,$83.90,Fiber Optic,Month-to-Month,One Line,False,False

In [16]:
df_excel_sample.shape

(100, 26)

In [19]:
df_excel.shape ## Question 2: Print the number of rows of your original dataframe

(7043, 26)

In [27]:
df_excel.columns[0:5] ## Question 3: Print the first five column names

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [28]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 26 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             7043 non-null   object
 1   gender                  7043 non-null   object
 2   is_senior_citizen       7043 non-null   int64
 3   partner                 7043 non-null   object
 4   dependents              7043 non-null   object
 5   phone_service           7043 non-null   int64
 6   internet_service        7043 non-null   int64
 7   contract_type           7043 non-null   int64
 8   payment_type            7043 non-null   object
 9   monthly_charges         7043 non-null   object
 10  total_charges           7032 non-null   object
 11  churn                   7043 non-null   object
 12  monthly tenure          7043 non-null   float64
 13  is_female               7043 non-null   bool
 14  has_churned             7043 non-null   bool
 15  has_phone               7043 non-null   bool
 16  has_internet            7043 non-null   bool
 17  has_phone_and_internet  7043 non-null   bool
 18  partner_dependants      7043 non-null   int64
 19  start_date              7043 non-null   object
 20  average_monthly         7043 non-null   object
 21  internet_description    7043 non-null   object
 22  contract_description    7043 non-null   object
 23  phone_description       7043 non-null   object
 24  only_phone              7043 non-null   bool
 25  only_internet           7043 non-null   bool
dtypes: bool(7), float64(1), int64(5), object(13)
memory usage: 1.1+ MB

In [34]:
df_excel.select_dtypes(include = object).columns ## Question 4: Print out the columns that 
## have object as their data type

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'monthly_charges', 'total_charges', 'churn', 'start_date',
       'average_monthly', 'internet_description', 'contract_description',
       'phone_description'],
      dtype='object')

In [42]:
df_excel.total_charges = df_excel.total_charges.astype(str)
df_excel.monthly_charges = df_excel.monthly_charges.astype(str)

In [43]:
df_excel.total_charges = df_excel.total_charges.str.replace('$','')
df_excel.total_charges = df_excel.total_charges.str.replace(',','').astype(float)
df_excel.monthly_charges = df_excel.monthly_charges.str.replace('$','')
df_excel.monthly_charges = df_excel.monthly_charges.str.replace(',','').astype(float)
df_excel.select_dtypes(include = float).columns ## Cleaning charges columns into floats

Index(['monthly_charges', 'total_charges', 'monthly tenure'], dtype='object')

In [46]:
total_charges_range = df_excel.total_charges.max() - df_excel.total_charges.min()
monthly_charges_range = df_excel.monthly_charges.max() - df_excel.monthly_charges.min()
total_charges_range, monthly_charges_range 

## Question 5: display the ranges for the 2 numerical columns

(8666.0, 100.5)

##### Read the data from this google sheet into a dataframe, df_google

In [48]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [49]:
df_google.head(3) ## Question 1: Print the first three rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [51]:
df_google.shape ## Question 2: Print the number of rows and columns

(891, 12)

In [52]:
df_google.columns ## Question 3: Print the column names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [54]:
df_google.info() ## Question 4: Print the datatypes of each column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [55]:
df_google.describe() ## Question 4: Print the summary statistics for each numeric 
## variable

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [67]:
## Printing out the unique values for each categorical variable below

In [60]:
df_google.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [61]:
df_google.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [62]:
df_google.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [63]:
df_google.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [74]:
df_google.select_dtypes(include='O').nunique()

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

#### Prepare Data Exercises

##### Use the function defined in acquire.py to load the iris data.

In [81]:
iris = get_iris_data()
iris.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

##### Drop the species_id and measurement_id columns.

In [82]:
## iris = iris.drop(columns='species_id') already dropped the column can't run again
iris.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

##### Rename the species_name column to just species.

In [13]:
iris = iris.rename(columns={'species_name': 'species'})
iris.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

##### Create dummy variables of the species name.

In [14]:
species_dummies = pd.get_dummies(iris.species)
species_dummies.head(3)

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0

In [15]:
species_dummies = pd.get_dummies(iris.species, drop_first=True)
species_dummies.head(3)

   versicolor  virginica
0           0          0
1           0          0
2           0          0

In [17]:
iris = pd.concat([iris, species_dummies], axis=1)
iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0,0,0

##### Create a function named prep_iris that accepts the untransformed iris data and returns the data with the transformations above applied.¶

In [19]:
def prep_iris():
    '''
    This function loads the untransformed iris data and returns the data with dropped
    redundant columns and dummy variables (preparing the data)
    '''
    df = get_iris_data()
    df = df.drop(columns='species_id').rename(columns={'species_name': 'species'})
    species_dummies = pd.get_dummies(df.species, drop_first=True)
    df = pd.concat([df, species_dummies], axis=1)
    
    return df

In [20]:
iris = prep_iris()
iris.sample(5)

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
1,setosa,4.9,3.0,1.4,0.2,0,0
26,setosa,5.0,3.4,1.6,0.4,0,0
110,virginica,6.5,3.2,5.1,2.0,0,1
10,setosa,5.4,3.7,1.5,0.2,0,0
111,virginica,6.4,2.7,5.3,1.9,0,1

## Tidy Data Exercises

#### Do your work for this exercise in a jupyter notebook or python script named tidy_data. Save this work in your classification-exercises repo. Then add, commit, and push your changes.

###### Question 1: Attendance Data

Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [83]:
attendance_df = pd.read_csv('untidy-data/attendance.csv')
attendance_df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [90]:
attendance_melted = attendance_df.melt(id_vars = 'Unnamed: 0', var_name = 'Day', value_name = 'Attendance')
attendance_melted = attendance_melted.rename(columns = {'Unnamed: 0': 'Student'})
attendance_melted

   Student         Day Attendance
0    Sally  2018-01-01          P
1     Jane  2018-01-01          A
2    Billy  2018-01-01          A
3     John  2018-01-01          P
4    Sally  2018-01-02          T
5     Jane  2018-01-02          P
6    Billy  2018-01-02          T
7     John  2018-01-02          T
8    Sally  2018-01-03          T
9     Jane  2018-01-03          T
10   Billy  2018-01-03          A
11    John  2018-01-03          H
12   Sally  2018-01-04          H
13    Jane  2018-01-04          T
14   Billy  2018-01-04          A
15    John  2018-01-04          P
16   Sally  2018-01-05          P
17    Jane  2018-01-05          T
18   Billy  2018-01-05          H
19    John  2018-01-05          P
20   Sally  2018-01-06          A
21    Jane  2018-01-06          T
22   Billy  2018-01-06          T
23    John  2018-01-06          T
24   Sally  2018-01-07          T
25    Jane  2018-01-07          A
26   Billy  2018-01-07          P
27    John  2018-01-07          P
28   Sally  2018-01-08          T
29    Jane  2018-01-08          T
30   Billy  2018-01-08          T
31    John  2018-01-08          P

In [110]:
## attendance_melted['Attendance'] = attendance_melted['Attendance'].replace({'T': 0.9, 'P': 1, 'A': 0.0, 'H': 0.5})
## Can't run code above twice so I commented it out
attendance_melted
attendance_melted = attendance_melted.drop(columns = 'attendance')
attendance_melted

   Student         Day  Attendance
0    Sally  2018-01-01         1.0
1     Jane  2018-01-01         0.0
2    Billy  2018-01-01         0.0
3     John  2018-01-01         1.0
4    Sally  2018-01-02         0.9
5     Jane  2018-01-02         1.0
6    Billy  2018-01-02         0.9
7     John  2018-01-02         0.9
8    Sally  2018-01-03         0.9
9     Jane  2018-01-03         0.9
10   Billy  2018-01-03         0.0
11    John  2018-01-03         0.5
12   Sally  2018-01-04         0.5
13    Jane  2018-01-04         0.9
14   Billy  2018-01-04         0.0
15    John  2018-01-04         1.0
16   Sally  2018-01-05         1.0
17    Jane  2018-01-05         0.9
18   Billy  2018-01-05         0.5
19    John  2018-01-05         1.0
20   Sally  2018-01-06         0.0
21    Jane  2018-01-06         0.9
22   Billy  2018-01-06         0.9
23    John  2018-01-06         0.9
24   Sally  2018-01-07         0.9
25    Jane  2018-01-07         0.0
26   Billy  2018-01-07         1.0
27    John  2018-01-07         1.0
28   Sally  2018-01-08         0.9
29    Jane  2018-01-08         0.9
30   Billy  2018-01-08         0.9
31    John  2018-01-08         1.0

In [111]:
attendance_melted.groupby(by=['Student']).mean()

         Attendance
Student
Billy        0.5250
Jane         0.6875
John         0.9125
Sally        0.7625

#### Question 2: Coffee Levels

#### Read the coffee_levels.csv file.

In [91]:
coffee_df = pd.read_csv('untidy-data/coffee_levels.csv')
coffee_df.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

#### Transform the data so that each carafe is in it's own column.

In [93]:
coffee_df.coffee_carafe.value_counts()

x    10
z    10
y    10
Name: coffee_carafe, dtype: int64

In [97]:
coffee_df.pivot(index = 'hour', columns = 'coffee_carafe')

              coffee_amount
coffee_carafe             x         y         z
hour
8                  0.816164  0.189297  0.999264
9                  0.451018  0.521502  0.915990
10                 0.843279  0.023163  0.144928
11                 0.335533  0.235529  0.311495
12                 0.898291  0.017009  0.771947
13                 0.310711  0.997464  0.398520
14                 0.507288  0.058361  0.864464
15                 0.215043  0.144644  0.436364
16                 0.183891  0.544676  0.280621
17                 0.391560  0.594126  0.436677

##### Is this the best shape for the data?

I believe this would be the best shape visually. We have easy to read columns for the readers. However, most likely not the best shape for a model/computer to read.

#### Question 3: Cake Recipes

#### Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.

Step One: Tidy the data as neccessary to perform the questions neccessary to complete the exercise

In [113]:
cake_df = pd.read_csv('untidy-data/cake_recipes.csv')
cake_df.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [114]:
cake_df['recipe:position'].str.split(':', expand = True)

   0       1
0  a  bottom
1  a     top
2  b  bottom
3  b     top
4  c  bottom
5  c     top
6  d  bottom
7  d     top

In [115]:
cake_df[['recipe', 'position']] = cake_df['recipe:position'].str.split(':', expand = True)
cake_df.head()

  recipe:position        225        250        275        300 recipe position
0        a:bottom  61.738655  53.912627  74.414730  98.786784      a   bottom
1           a:top  51.709751  52.009735  68.576858  50.228470      a      top
2        b:bottom  57.095320  61.904369  61.196980  99.248541      b   bottom
3           b:top  82.455004  95.224151  98.594881  58.169349      b      top
4        c:bottom  96.470207  52.001358  92.893227  65.473084      c   bottom

In [117]:
cake_df = cake_df.drop(columns = 'recipe:position')
cake_df.head()

         225        250        275        300 recipe position
0  61.738655  53.912627  74.414730  98.786784      a   bottom
1  51.709751  52.009735  68.576858  50.228470      a      top
2  57.095320  61.904369  61.196980  99.248541      b   bottom
3  82.455004  95.224151  98.594881  58.169349      b      top
4  96.470207  52.001358  92.893227  65.473084      c   bottom

In [120]:
melted_cake = cake_df.melt(id_vars = ['recipe', 'position'], 
                           var_name = 'Temperature', 
                           value_name = 'Taste_Score')
melted_cake

   recipe position Temperature  Taste_Score
0       a   bottom         225    61.738655
1       a      top         225    51.709751
2       b   bottom         225    57.095320
3       b      top         225    82.455004
4       c   bottom         225    96.470207
5       c      top         225    71.306308
6       d   bottom         225    52.799753
7       d      top         225    96.873178
8       a   bottom         250    53.912627
9       a      top         250    52.009735
10      b   bottom         250    61.904369
11      b      top         250    95.224151
12      c   bottom         250    52.001358
13      c      top         250    82.795477
14      d   bottom         250    58.670419
15      d      top         250    76.101363
16      a   bottom         275    74.414730
17      a      top         275    68.576858
18      b   bottom         275    61.196980
19      b      top         275    98.594881
20      c   bottom         275    92.893227
21      c      top         275    92.098049
22      d   bottom         275    51.747686
23      d      top         275    59.571620
24      a   bottom         300    98.786784
25      a      top         300    50.228470
26      b   bottom         300    99.248541
27      b      top         300    58.169349
28      c   bottom         300    65.473084
29      c      top         300    53.960273
30      d   bottom         300    56.183110
31      d      top         300    50.971626

#### Which recipe, on average, is the best?

In [121]:
melted_cake.groupby(by=['recipe']).mean()

## recipe b seems to perform the best in the taste_score category

        Taste_Score
recipe
a         63.922201
b         76.736074
c         75.874748
d         62.864844

#### Which oven temperature, on average, produces the best results?

In [122]:
melted_cake.groupby(by=['Temperature']).mean()

### 275 degree oven temperature produces the best results according to the Taste_Score column

             Taste_Score
Temperature
225            71.306022
250            66.577437
275            74.886754
300            66.627655

#### Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [130]:
stacked_df = melted_cake.groupby(by=['recipe', 'position', 'Temperature']).mean()
stacked_df

                             Taste_Score
recipe position Temperature
a      bottom   225            61.738655
                250            53.912627
                275            74.414730
                300            98.786784
       top      225            51.709751
                250            52.009735
                275            68.576858
                300            50.228470
b      bottom   225            57.095320
                250            61.904369
                275            61.196980
                300            99.248541
       top      225            82.455004
                250            95.224151
                275            98.594881
                300            58.169349
c      bottom   225            96.470207
                250            52.001358
                275            92.893227
                300            65.473084
       top      225            71.306308
                250            82.795477
                275            92.098049
                300            53.960273
d      bottom   225            52.799753
                250            58.670419
                275            51.747686
                300            56.183110
       top      225            96.873178
                250            76.101363
                275            59.571620
                300            50.971626

In [133]:
melted_cake.groupby(by=['recipe', 'position', 'Temperature']).mean().max()

Taste_Score    99.248541
dtype: float64

In [136]:
column = stacked_df['Taste_Score']
column.idxmax()

## The best performing overall combination for baking is recipe b, oven rack position on the bottom
## and 300 degrees for the temperature

('b', 'bottom', '300')